{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "gamma_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "trainable": true, "name": "batchnormalization_1", "input_dtype": "float32", "axis": 1, "momentum": 0.99, "beta_regularizer": null, "epsilon": 0.001}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "W_regularizer": null, "nb_row": 5, "name": "convolution2d_1", "b_constraint": null, "W_constraint": null, "nb_col": 5, "bias": true, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "nb_filter": 24, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.3}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "W_regularizer": null, "nb_row": 5, "name": "convolution2d_2", "b_constraint": null, "W_constraint": null, "nb_col": 5, "bias": true, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "nb_filter": 36, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.3}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "W_regularizer": null, "nb_row": 5, "name": "convolution2d_3", "b_constraint": null, "W_constraint": null, "nb_col": 5, "bias": true, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "nb_filter": 48, "dim_ordering": "tf", "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.3}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "W_regularizer": null, "nb_row": 3, "name": "convolution2d_4", "b_constraint": null, "W_constraint": null, "nb_col": 3, "bias": true, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.3}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "W_regularizer": null, "nb_row": 3, "name": "convolution2d_5", "b_constraint": null, "W_constraint": null, "nb_col": 3, "bias": true, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.3}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "output_dim": 100, "name": "dense_1", "b_constraint": null, "W_constraint": null, "input_dim": null, "bias": true, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "output_dim": 50, "name": "dense_2", "b_constraint": null, "W_constraint": null, "input_dim": null, "bias": true, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "output_dim": 10, "name": "dense_3", "b_constraint": null, "W_constraint": null, "input_dim": null, "bias": true, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "output_dim": 1, "name": "dense_4", "b_constraint": null, "W_constraint": null, "input_dim": null, "bias": true, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_4"}}], "keras_version": "1.1.2"}